Функция queryВыполнитьЗапросКБазеДанных(Запрос)
    // Получаем тело запроса в виде строки
    ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
    // Считываем запрос в виде JSON
    СтрокаJSONЗапрос = Новый ЧтениеJSON();
    СтрокаJSONЗапрос.УстановитьСтроку(ТелоЗапроса);
    ДанныеЗапроса = ПрочитатьJSON(СтрокаJSONЗапрос);
    // Извлекаем текст запроса 1С
    ТекстЗапросаК1С = ДанныеЗапроса["query_text"];
    // Выполняем запрос к базе данных
    ЗапросКБазе = Новый Запрос(ТекстЗапросаК1С);
	Попытка
    	Результат = ЗапросКБазе.Выполнить();
	Исключение
	    Ответ = Новый HTTPСервисОтвет(500);
	    ЗаписьJSON = Новый ЗаписьJSON;
	    ЗаписьJSON.УстановитьСтроку();
	    ДанныеОтвета = Новый Структура;
	    ДанныеОтвета.Вставить("error", ОписаниеОшибки());
	    ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета);
	    СтрокаJSONОтвет = ЗаписьJSON.Закрыть();
	    Ответ.УстановитьТелоИзСтроки(СтрокаJSONОтвет);
	    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	    Возврат Ответ;
	КонецПопытки;
    // Получаем данные запроса в виде массива
    ТаблицаРезультата = Результат.Выгрузить();
    ДанныеРезультата = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата);
    // Формируем ответ c данными в виде JSON
    Ответ = Новый HTTPСервисОтвет(200);
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ДанныеОтвета = Новый Структура;
    ДанныеОтвета.Вставить("data",ДанныеРезультата);
    ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета);
    СтрокаJSONОтвет = ЗаписьJSON.Закрыть();
    Ответ.УстановитьТелоИзСтроки(СтрокаJSONОтвет);
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Возврат Ответ;
КонецФункции
