Функция queryВыполнитьЗапросКБазеДанных(Запрос)
    // Получаем тело запроса в виде строки
    ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
    // Считываем запрос в виде JSON
    СтрокаJSONЗапрос = Новый ЧтениеJSON();
    СтрокаJSONЗапрос.УстановитьСтроку(ТелоЗапроса);
    ДанныеЗапроса = ПрочитатьJSON(СтрокаJSONЗапрос);
    // Извлекаем текст запроса 1С
    ТекстЗапросаК1С = ДанныеЗапроса["query_text"];
    // Выполняем запрос к базе данных
    ЗапросКБазе = Новый Запрос(ТекстЗапросаК1С);
	Попытка
    	Результат = ЗапросКБазе.Выполнить();
	Исключение
	    Ответ = Новый HTTPСервисОтвет(500);
	    ЗаписьJSON = Новый ЗаписьJSON;
	    ЗаписьJSON.УстановитьСтроку();
	    ДанныеОтвета = Новый Структура;
	    ДанныеОтвета.Вставить("error", ОписаниеОшибки());
	    ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета);
	    СтрокаJSONОтвет = ЗаписьJSON.Закрыть();
	    Ответ.УстановитьТелоИзСтроки(СтрокаJSONОтвет);
	    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	    Возврат Ответ;
	КонецПопытки;
    // Получаем данные запроса в виде массива
    ТаблицаРезультата = Результат.Выгрузить();
	// Преобразуема данные запроса в массив строк
	МассивСтрок = Новый Массив;
	Для Каждого Строчка Из ТаблицаРезультата Цикл
        // Создаем структуру для хранения значений строки
        СтруктураСтроки = Новый Структура;
        // Проходим по колонкам и добавляем их в структуру
        Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
            ИмяКолонки = Колонка.Имя;
	        СтруктураСтроки.Вставить(ИмяКолонки, Строка(Строчка[ИмяКолонки]));
        КонецЦикла;
        // Добавляем структуру в массив
        МассивСтрок.Добавить(СтруктураСтроки);
    КонецЦикла;
    // Формируем ответ c данными в виде JSON
    Ответ = Новый HTTPСервисОтвет(200);
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ДанныеОтвета = Новый Структура;
    ДанныеОтвета.Вставить("data", МассивСтрок);
    ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета,);
    СтрокаJSONОтвет = ЗаписьJSON.Закрыть();
    Ответ.УстановитьТелоИзСтроки(СтрокаJSONОтвет);
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Возврат Ответ;
КонецФункции

Функция structureПолучитьСтруктурыБазыДанных(Запрос)
	// Получаем структуру хранения (с полями)
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных(, Истина);
	// Массив для хранения описаний всех таблиц
	МассивТаблиц = Новый Массив;
	// Обрабатываем каждую таблицу
	Для Каждого Таблица Из СтруктураХранения Цикл
		Если Таблица.Назначение = "Основная" Тогда
			ОписаниеТаблицы = Новый Структура;
			ОписаниеТаблицы.Вставить("ИмяТаблицы", Таблица.ИмяТаблицы);
			ОписаниеТаблицы.Вставить("Метаданные", Таблица.Метаданные);
			// Формируем массив полей
			МассивПолей = Новый Массив;
			Для Каждого Поле Из Таблица.Поля Цикл
				ОписаниеПоля = Новый Структура;
				ОписаниеПоля.Вставить("ИмяПоля", Поле.ИмяПоля);
				ОписаниеПоля.Вставить("Метаданные", Поле.Метаданные);
				МассивПолей.Добавить(ОписаниеПоля); 
			КонецЦикла;
			ОписаниеТаблицы.Вставить("Поля", МассивПолей);
			МассивТаблиц.Добавить(ОписаниеТаблицы);
		КонецЕсли;
	КонецЦикла;
    // Формируем ответ c данными в виде JSON
    Ответ = Новый HTTPСервисОтвет(200);
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ДанныеОтвета = Новый Структура;
    ДанныеОтвета.Вставить("structure",МассивТаблиц);
    ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета);
    СтрокаJSONОтвет = ЗаписьJSON.Закрыть();
    Ответ.УстановитьТелоИзСтроки(СтрокаJSONОтвет);
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Возврат Ответ;
КонецФункции
